Natural_Reef_CFD/lowRelief/Scenario_9/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          64;
        startFace       320040;
    }
    outlet
    {
        type            patch;
        nFaces          67;
        startFace       320104;
    }
    atmosphere
    {
        type            patch;
        nFaces          226;
        startFace       320171;
    }
    bathymetry
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1567;
        startFace       320397;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          320024;
        startFace       321964;
    }
)

// ************************************************************************* //
